---
kind: enumMember
id: F:Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NonContinuousInputCurveLoop
enum: Autodesk.Revit.DB.MeshFromGeometryOperationIssue
source: html/6c89d542-b05c-bbbf-eb8d-e291d71865d0.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NonContinuousInputCurveLoop

A non-continuous input curve loop. Either wrong curve flips
 or genuine gaps.